#+title: Sprint Backlog 58
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) spike(p) }

* Commentary

** Mission

Implement dynamic and start making use of it in SML.

** Retrospective

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree
Clock summary at [2015-01-03 Sat 15:02]

| Headline                                    | Time   |      |      |
|---------------------------------------------+--------+------+------|
| *Total time*                                | *3:46* |      |      |
|---------------------------------------------+--------+------+------|
| Active                                      |        | 3:46 |      |
| STARTED Sprint and product backlog grooming |        |      | 0:50 |
| COMPLETED Implement dynamic's workflow      |        |      | 2:56 |
#+end:

*** STARTED Sprint and product backlog grooming                       :story:
    CLOCK: [2015-01-03 Sat 14:33]--[2015-01-03 Sat 15:02] =>  0:14
    CLOCK: [2014-12-29 Mon 22:15]--[2014-12-29 Mon 22:25] =>  0:10
    CLOCK: [2014-12-16 Tue 15:50]--[2014-12-16 Tue 16:01] =>  0:08

Updates to sprint and product backlog.

*** COMPLETED Implement dynamic's workflow                            :story:
    CLOSED: [2015-01-03 Sat 14:33]
    CLOCK: [2015-01-03 Sat 14:12]--[2015-01-03 Sat 14:33] =>  0:21
    CLOCK: [2015-01-03 Sat 13:42]--[2015-01-03 Sat 14:10] =>  0:28
    CLOCK: [2014-12-29 Mon 23:53]--[2014-12-30 Tue 00:01] =>  0:08
    CLOCK: [2014-12-29 Mon 22:25]--[2014-12-29 Mon 23:53] =>  1:28
    CLOCK: [2014-12-16 Tue 16:14]--[2014-12-16 Tue 16:33] =>  0:19
    CLOCK: [2014-12-16 Tue 16:01]--[2014-12-16 Tue 16:13] =>  0:12

We have started the basic skeleton for the dynamic classes; continue
this work by implementing the workflow and it's dependent classes.

*Random Thoughts*

- we should remove default values for now. We do not have a good story
  on how it will work, and we can default things by hard-coding them
  for now. It is not clear that making defaults dynamic will give any
  benefits and it is already clear it is not trivial to get right. As
  part of this change we renamed =is_optional= to =is_mandatory=. Also
  removed the =value_types= in value as it is not clear how it will be
  used yet.

*** COMPLETED Rename =Taggable= to =Extensible=                       :story:
    CLOSED: [2015-01-03 Sat 15:07]
    CLOCK: [2015-01-03 Sat 15:07]--[2015-01-03 Sat 15:11] =>  0:04
    CLOCK: [2015-01-03 Sat 15:03]--[2015-01-03 Sat 15:07] =>  0:04

SML objects have meta-data object instead of the ptree; Taggable is
perhaps not the best name for the concept but we need to think of a
better alternative. =Extensible= perhaps? =DynamicallyExtensible=?

Final decision: =Extensible=.

*** Add dynamic object to =DynamicallyExtensible=                     :story:

For now we keep =ptree= side-by-side with dynamic.

*** Add field definitions for existing fields                         :story:

We need to start generating the field definitions for the fields we
need to consume. Create these using the existing static data
machinery.

*** Replace uses of meta-data with dynamic object                     :story:

Find all places where we are using ptree and use the dynamic object
instead. This should be mainly in meta-data factories.

*** Rename namespace =meta-data= to =dynamic=                         :story:

We have created a number of "meta-data extension" namespaces, which is
where we transform the ptree into a strongly typed object. These
should be renamed to =dynamic= to make it consistent.

*** Remove all references to =ptree=                                  :story:

Delete reader and writer classes and remove meta-data from
=DynamicallyExtensible=.

*** Add merger to dynamic                                             :story:

We need a class that takes two objects and merges them. For example
the root module meta-data object and any type. Could be called
merger. Should have a lhs and a rhs and produce a result.

*Note*: we still need to prove the use case; it may be that we do not
need merging at all.

*** Add dynamic merging to SML workflow                               :story:

We need an extra activity in the SML workflow that makes use of the
=dynamic::merger= to produce the final dynamic object.

*Note*: we still need to prove the use case; it may be that we do not
need merging at all.

*** Remove dependency of writer on tags                               :story:

We seem to be using the tags to detect containers. We need to get rid
of this dependency.

*** Delete tags class in SML                                          :story:

This class does not make sense any more as each model will be
responsible for their own tags.

** Deprecated

*** CANCELLED Utility meta-data factory                               :story:
    CLOSED: [2015-01-03 Sat 15:00]

*Rationale*: This won't make sense after the dynamic refactor.

Now that we have a number of meta-data factories that produce settings
we should be able to factor out all their commonalities and add a
utility factory to the =formatters= model that handles all use
cases. Each factory then uses the utility factory instead of calling
reader etc directly.

We can't create a single factory because we need to generate multiple
products that are model dependent.

*** CANCELLED Consider merging graphers into a single class           :story:
    CLOSED: [2015-01-03 Sat 15:00]

*Rationale*: Graphers got removed some time ago.

After the meta-data work, we ended up with two separate graphers doing
similar things. We should look into the commonalities of these classes
to see if we can reuse code.
